<section class="lesson" id="task2-informatics">
  <div class="lesson-description">
    <h3>Краткие сведения</h3>
    <p>
      В этом задании нужно уметь с помощью Python писать короткие скрипты для
      создания таблицы истинности. Важно уметь переводить логические формулы из
      задания в код. Дополнительно нужно делать проверки на правду или ложь.
    </p>
    <p>Как выглядят знаки из задания в Python:</p>
    <div class="table-container">
      <table class="truth-table">
        <thead>
          <tr>
            <th>∨ это or</th>
            <th>∧ это and</th>
            <th>→ это <=</th>
            <th>≡ (↔) это ==</th>
            <th>¬ это not</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td>x ∨ y</td>
            <td>x ∧ y</td>
            <td>x → y</td>
            <td>x ≡ y</td>
            <td>¬y</td>
          </tr>
          <tr>
            <td>x or y</td>
            <td>x and y</td>
            <td>x <= y</td>
            <td>x == y</td>
            <td>not y</td>
          </tr>
        </tbody>
      </table>
    </div>
  </div>

  <div class="lesson-content">
    <h3>Методы решения</h3>

    <div class="method-card">
      <h4>Метод 1: цикл for в Python</h4>
      <p>
        Используем цикл for в Python для перебора всех возможных значений (0 и
        1) переменных и вычисления значения функции. Также делаем проверку на 1
        или 0, которая нужна для вывода на экран только нужных значений
        переменных.
      </p>

      <div class="code-block">
        <h4>Задача 1</h4>
        <p>
          Миша заполнял таблицу истинности логической функции F: <br />
          <b> ((x V y) → z) V (y ≡ w) V z, </b><br />
          но успел заполнить лишь фрагмент из трёх различных её строк, даже не
          указав, какому столбцу таблицы соответствует каждая из переменных w,
          x, y, z.
        </p>
        <div class="table-container">
          <table class="truth-table">
            <thead>
              <tr>
                <th>___</th>
                <th>___</th>
                <th>___</th>
                <th>___</th>
                <th>F</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td>0</td>
                <td>1</td>
                <td></td>
                <td></td>
                <td>0</td>
              </tr>
              <tr>
                <td>1</td>
                <td></td>
                <td>1</td>
                <td>0</td>
                <td>0</td>
              </tr>
              <tr>
                <td></td>
                <td>1</td>
                <td>1</td>
                <td>0</td>
                <td>0</td>
              </tr>
            </tbody>
          </table>
        </div>
        <p>
          Определите, какому столбцу таблицы соответствует каждая из переменных
          w, x, y, z. <br />
          В ответе напишите буквы w, х, у, z в том порядке, в котором идут
          соответствующие им столбцы (сначала буква, соответствующая первому
          столбцу; затем буква, соответствующая второму столбцу, и т.д.). Буквы
          в ответе пишите подряд, никаких разделителей между буквами ставить не
          нужно.
        </p>

        <div class="code-wrapper">
          <pre><code class="language-python">
# Решение задачи 1
(1) print('x y w z') #шапка таблицы

# 4 цикла для перебора значений 0 и 1 переменных x y w z 
for x in 0,1:
  for y in 0,1:
    for w in 0,1:
      for z in 0,1:
        f = ((x or y) <= z) or (y == w) or z #логическая формула
        if f == 0: #проверяем, что формула вернет нам 0
          print(x,y,w,z) #печатаем значения переменных, если формула вернула 0</code></pre>
        </div>
        <h4>Что делает этот код!</h4>
        <p>Будем двигаться по порядку:</p>
        <ol>
          <li>
            <span class="text-attention">print('x y w z')</span> - эта строка
            нужна для вывода заголовков таблицы. Она просто делает удобным
            чтение результата;
          </li>
          <li>
            <span class="text-attention">for x in 0,1:</span> это цикл, который
            создает переменную Х и кладет в нее сначала цифру 1, затем, когда
            цикл выполнит свои задачи, кладет цифру 2 и повторяет выполение
            кода, который находится внутри него;
          </li>
          <li>
            В питоне отступы от левого края нужны для того, чтобы компьютер
            понимал, какая команда лежит внутри другой. В данном примере видим,
            что первым идет цикл с перменной Х, а внутри него (видим отступ
            цикла с переменной Y) лежит другой цикл, внутри которого лежит 3-й
            цикл, в котором лежит 4-й =)
          </li>
          <li>
            <span class="text-attention"
              >f = ((x or y) <= z) or (y == w) or z</span
            >
            - это логическая формула из задания. Переписали как есть, заменили
            знаки на нужные;
          </li>
          <li>
            <span class="text-attention">if f == 0:</span> - это условие,
            проверка, которая нужна для того, чтобы пропускать только те 1 и 0,
            при которых логическая формула даст нам ответ 0;
          </li>
          <li>
            <span class="text-attention">print(x,y,w,z)</span> - это команда
            вывода на экран переменные.
          </li>
        </ol>
        <h4>А что делать дальше?</h4>
        <p>
          А дальше нужно своими глазами сравнить кусок таблицы из задания и то,
          что нам выведет программа. Ищем связи и закономерности, расставляем
          буквы.
        </p>
        <div class="table-container">
          <table class="truth-table">
            <thead>
              <tr>
                <th>Таблица из задачи</th>
                <th>Таблица из Кода</th>
                <th>Ответ</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td>
                  0 1 _ _ <br />
                  1 _ 1 0<br />
                  _ 1 1 0
                </td>
                <td>
                  x y w z <br />
                  0 1 0 0 <br />
                  1 0 1 0<br />
                  1 1 0 0
                </td>
                <td>
                  w y x z <br />
                  0 1 0 0 <br />
                  1 0 1 0<br />
                  0 1 1 0
                </td>
              </tr>
            </tbody>
          </table>
        </div>
        <p>
          Позиция для Х - 1, 3 <br />
          Позиция для Y - 2 <br />
          Позиция для W - 1 <br />
          Позиция для Z - 4
        </p>
        <p>
          Видим, что для Х осталось свободная только позиция 3. Отсюда ответ:
          <span class="text-attention">wyxz</span>
        </p>
      </div>
    </div>
  </div>

  <style></style>
</section>
